org/slam_compile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>slam交叉编译环境搭建指南</title>
<!-- 2020-09-25 Ба 12:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">slam交叉编译环境搭建指南</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. slam交叉编译环境搭建</a>
<ul>
<li><a href="#sec-1-1">1.1. 注意事项</a></li>
<li><a href="#sec-1-2">1.2. 安装第三方库</a>
<ul>
<li><a href="#sec-1-2-1">首先安装如下软件包</a></li>
<li><a href="#sec-1-2-2">其次根据对照如下链接安装第三方库</a></li>
<li><a href="#sec-1-2-3">根据文档下载代码编译安装(make install默认路径/usr/local即可)</a></li>
<li><a href="#sec-1-2-4">执行slam编译脚本build.sh</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> slam交叉编译环境搭建</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 注意事项</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>服务器系统版本: 16.04(arm架构)
</li>

<li>gcc/g++版本: 5.4.0
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 安装第三方库</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">首先安装如下软件包</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
apt-get install -y libglew-dev libboost-dev libboost-thread-dev libboost-filesystem-dev 
libboost-all-dev libx11-dev libxmu-dev libglu1-mesa-dev libgl2ps-dev libxi-dev 
libzip-dev libpng12-dev libcurl4-gnutls-dev libfontconfig1-dev libsqlite3-dev 
libglew*-dev libssl-dev build-essential libgtk2.0-dev libvtk5-dev libjpeg-dev 
libtiff5-dev libjasper-dev libopenexr-dev libtbb-dev libeigen3-dev libc6-dev-i386  autoconf automake libtool
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">其次根据对照如下链接安装第三方库</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
http://192.168.50.158/VisualModule/CleaningRobotSDK/blob/develop/slam/README
http://192.168.50.158/VisualModule/CleaningRobotSDK/blob/develop/slam/README.md
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">根据文档下载代码编译安装(make install默认路径/usr/local即可)</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example">
git clone https://github.com/gflags/gflags.git
git clone https://github.com/google/glog
git clone https://github.com/stevenlovegrove/Pangolin.git
git clone  https://github.com/borglab/gtsam -b develop(编译安装后进入目录gtsam
/3rdparty/Eigen,进行编译安装)
git clone https://github.com/opencv/opencv(checout 为b38c50b3d0c31e82294315ec44b54b7ef559ef12,需要特定版本3.4.3)
</pre>
<p>
gitlab下载项目CleaningRobotSDK,分支为devlop,进入目录third_party/yaml-cpp,编译安装此库
</p>
</div>
</div>


<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">执行slam编译脚本build.sh</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-09-25 Ба 12:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
